[{"id":"piQGEAAAQBAJ","name":"On Democracy","authors":["Robert A. Dahl"],"coverUrl":"http://books.google.com/books/content?id=piQGEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Written by the preeminent democratic theorist of our time, this book explains the nature, value, and mechanics of democracy. In a new introduction to this Veritas edition, Ian Shapiro considers how Dahl would respond to the ongoing challenges democracy faces in the modern world. \"Within the liberal democratic camp there is considerable controversy about exactly how to define democracy. Probably the most influential voice among contemporary political scientists in this debate has been that of Robert Dahl.\"--Marc Plattner, New York Times \"An excellent introduction for novices, as well as a trusty handbook for experts and political science mavens.\"--Publishers Weekly","pages":286,"publishedAt":"2020-11-24","url":"http://books.google.com/books?id=piQGEAAAQBAJ&dq=intitle:On+Democracy+inauthor:Robert+Dahl&hl=&source=gbs_api"},{"id":"A50iBxwt7qMC","name":"Economics in One Lesson","authors":["Henry Hazlitt"],"coverUrl":"http://books.google.com/books/content?id=A50iBxwt7qMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Over a million copies sold! A fundamental influence on modern libertarianism, this classic guide to the basics of economic theory defends capitalism and the free market from economic myths that persist to this day. “A magnificent job of theoretical exposition.”—Ayn Rand Considered among the leading economic thinkers of the “Austrian School,” which includes Carl Menger, Ludwig von Mises, Friedrich (F.A.) Hayek, and others, Henry Hazlitt wrote Economics in One Lesson in 1946. Concise and instructive, it is also deceptively prescient and far-reaching in its efforts to dissemble economic fallacies that are so prevalent they have almost become a new orthodoxy. Economic commentators across the political spectrum have credited Hazlitt with foreseeing the collapse of the global economy which occurred more than fifty years after the initial publication of Economics in One Lesson. Hazlitt’s focus on non-governmental solutions, strong—and strongly reasoned—anti-deficit position, and general emphasis on free markets, economic liberty of individuals, and the dangers of government intervention make Economics in One Lesson every bit as relevant and valuable today as it has been since publication.","pages":220,"publishedAt":"2010-08-11","url":"https://play.google.com/store/books/details?id=A50iBxwt7qMC&source=gbs_api"},{"id":"oVaNBQAAQBAJ","name":"Basic Economics","authors":["Thomas Sowell"],"coverUrl":"http://books.google.com/books/content?id=oVaNBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"The bestselling citizen's guide to economics Basic Economics is a citizen's guide to economics, written for those who want to understand how the economy works but have no interest in jargon or equations. Bestselling economist Thomas Sowell explains the general principles underlying different economic systems: capitalist, socialist, feudal, and so on. In readable language, he shows how to critique economic policies in terms of the incentives they create, rather than the goals they proclaim. With clear explanations of the entire field, from rent control and the rise and fall of businesses to the international balance of payments, this is the first book for anyone who wishes to understand how the economy functions. This fifth edition includes a new chapter explaining the reasons for large differences of wealth and income between nations. Drawing on lively examples from around the world and from centuries of history, Sowell explains basic economic principles for the general public in plain English.","pages":990,"publishedAt":"2014-12-02","url":"https://play.google.com/store/books/details?id=oVaNBQAAQBAJ&source=gbs_api"},{"id":"G9dujCGmhnAC","name":"Anatomy of the State","authors":[],"coverUrl":"http://books.google.com/books/content?id=G9dujCGmhnAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"Murray Rothbard was known as the state's greatest living enemy, and this is his most succinct and powerful statement on the topic, an exhibit A in how he came to wear that designation proudly. He shows how the state wrecks freedom, destroys civilization, and threatens all lives and property and social well being. This gives a succinct account of Rothbard’s view of the state. Following Franz Oppenheimer and Albert Jay Nock, Rothbard regards the state as a predatory entity. It does not produce anything but rather steals resources from those engaged in production. In applying this view to American history, Rothbard makes use of the work of John C. Calhoun How can an organization of this type sustain itself? It must engage in propaganda to induce popular support for its policies. Court intellectuals play a key role here, and Rothbard cites as an example of ideological mystification the work of the influential legal theorist Charles Black, Jr., on the way the Supreme Court has become a revered institution.","pages":63,"url":"https://play.google.com/store/books/details?id=G9dujCGmhnAC&source=gbs_api"},{"id":"tJf8DwAAQBAJ","name":"Animal Farm","authors":["George Orwell"],"coverUrl":"http://books.google.com/books/content?id=tJf8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","description":"George Orwell was a much-respected English novelist, who wrote some of the finest pieces in literary criticism, fiction. Orwells work is known for its simplicity and wit. He wrote with smartness on subjects such as anti-fascism, democratic socialism etc. His best works include ANIMAL FARM. Its an allegorical novella. It got published in August 1945. The fiction based on Farm animals, the author has named them too. Such as Major (a majestic-looking pig), 3-dogs (Bluebell, Jessie, and Pincher), many hens, pigeons, ducklings, sheeps and cows. Two horses, Boxer and Clover. Amongst them, Major is their leader. He wanted to speak on the nature of life on this earth and How any animal is now living. The author has nicely elaborated through these Characters about the animals misery and slavery. Animals complain that despite their hard labour, why then do they continue in the misrable condition? They also complain about human beings that they use to steal nearly the whole of their produce. Their main enemy is - Man. So, remove Man from the scene and the root cause of hunger and overwork will be abolished for ever. The book narrates about the agony of ill-treated farm animals. Then what decision they take and how this Animal Farm born, everything has become very interesting. The ultimate satire on fascism. A must-read book. A Wise, Compassionate, and Illuminating Fable for our Times THE NEW YORK TIMES Orwells Satire is Amply Broad, Cleverly Conceived, and Delightfully Written SAN FRANCISCO CHRONICLE Absolutely First-Rate... Comparable to Voltaire and Swift THE NEW YORKER","pages":107,"publishedAt":"2020-09-12","url":"https://play.google.com/store/books/details?id=tJf8DwAAQBAJ&source=gbs_api"}]